OpenFOAM-5.x/tutorials/demo/pimplePipe/WK2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
    inlet
    {   
	type            cardiovascularFlowRateInletVelocity;
        value           uniform ( 0 0 0 );
        flowRateModel   rawDataFlowRate;
        rawDataFlowRateCoeffs
        {
            outOfBounds     repeat;
            file            "constant/i_t_values.txt";
            scaling         constant 1;
        }    
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
